<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"304b731123375ed859363d09bce3743fe0354c465b215a67deee6a9aa9e5791f","plan_job_ref":"Job Write Terraform Plan to Pull Request #61 at https://github.com/hackforla/devops-security/actions/runs/11604227009","plan_out_hash":"2e0c36eb5635928fa91bc2cc38204d63dc3dfb30d294f93322d471764bbeef80","plan_hash":"1358435c4d820d33e048743ef40079cfb4b11861c662c1556c6b2751b130c225","plan_text_format":"diff","version":"1.44.0"} -->
Terraform plan in __terraform__
With backend config files: `terraform/prod.backend.tfvars`
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.iam_user_lsousadev.aws_iam_user.user will be created
+   resource "aws_iam_user" "user" {
+       arn           = (known after apply)
+       force_destroy = false
+       id            = (known after apply)
+       name          = "lsousadev"
+       path          = "/"
+       tags          = {
+           "Access Level" = "1"
+           "Project"      = "devops-security"
        }
+       tags_all      = {
+           "Access Level" = "1"
+           "Project"      = "devops-security"
        }
+       unique_id     = (known after apply)
    }

  # module.iam_user_lsousadev.aws_iam_user_group_membership.user_group_membership will be created
+   resource "aws_iam_user_group_membership" "user_group_membership" {
+       groups = [
+           "read-only-group",
        ]
+       id     = (known after apply)
+       user   = "lsousadev"
    }

  # module.iam_user_lsousadev.aws_iam_user_login_profile.user_login will be created
+   resource "aws_iam_user_login_profile" "user_login" {
+       encrypted_password      = (known after apply)
+       id                      = (known after apply)
+       key_fingerprint         = (known after apply)
+       password                = (known after apply)
+       password_length         = 20
+       password_reset_required = true
+       user                    = "lsousadev"
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Write Terraform Plan to Pull Request #61](https://github.com/hackforla/devops-security/actions/runs/11604227009)